
# -*- org-emphasis-alist: nil -*-

#+TITLE: Pathfinder Character Sheet
#+AUTHOR: Lucas Meyers (Adapted from Jesus Ramos)

* Basic Character Info
  - Name :: Dahlia Coreopsideae
  - Race :: Elf
  - Gender :: Female
  - Height :: 5'7""
  - Weight :: 99 lbs
  - Age :: 139
  - Alignment :: Chaotic Good
  - Deity :: Shadow Patron
  - Background Occupation :: Hag/Witch Hunter
  - Languages :: Common, Elvish, Orc, Celestial, Draconic, Old Gnomish
		 Sylvan, Dwarvish, Halfling, Old Thosian, Infernal,
		 Abyssal, Necril, Protean, Aklo, Tengu, Giant, Undercommon

  #+NAME:Buffs
  |----------------+--------+-----+-----+-----+-----+-----+-----+----+------|
  | Buff           | Active | Str | Dex | Con | Int | Wis | Cha | AC | Size |
  |----------------+--------+-----+-----+-----+-----+-----+-----+----+------|
  | Aspect Young   |      0 |     |   2 |   2 |     |  -2 |     |    |      |
  | Aspect Middle  |      0 |     |  -2 |     |   2 |   2 |     |    |      |
  | Aspect Old     |      1 |  -2 |  -2 |     |   4 |   4 |     |    |      |
  | Enlarge Person |      0 |   2 |  -2 |     |     |     |     |    |   -1 |
  | Reduce Person  |      0 |  -2 |   2 |     |     |     |     |    |    1 |
  |----------------+--------+-----+-----+-----+-----+-----+-----+----+------|

  #+NAME:Size
  |------------|
  | Size Bonus |
  |------------|
  |          0 |
  |------------|

* Character Stats
  #+NAME:Stats
  |---+--------------+-------+----------+------+----------+---------+------|
  | ! | Stat         | Total | Modifier | Base | Inherent | Enhance | Misc |
  |---+--------------+-------+----------+------+----------+---------+------|
  | # | Strength     |     5 | -3       |    7 |          |      -2 |      |
  | # | Dexterity    |    12 | 1        |   14 |          |      -2 |      |
  | # | Constitution |    12 | 1        |   12 |          |         |      |
  | # | Intelligence |    28 | 9        |   24 |          |       4 |      |
  | # | Wisdom       |    16 | 3        |   12 |          |       4 |      |
  | # | Charisma     |     8 | -1       |    8 |          |         |      |
  |---+--------------+-------+----------+------+----------+---------+------|
  #+TBLFM: $3=vsum($5..$8)::$4=floor(($3 - 10) / 2)

  #+NAME:Initiative
  |---+------------+-------+------+------|
  | ! |            | Total | Base | Misc |
  |---+------------+-------+------+------|
  | # | Initiative |     3 |    1 |    2 |
  |---+------------+-------+------+------|
  #+TBLFM: @2$3=vsum(@2$4..@2$5)::@2$4=remote(Stats, @3$Modifier)

* Class
  #+NAME:Class
  |---+--------+----+---------------+-----+--------+------+-----+------+--------|
  | ! |     HP | HD | Class Name    | BAB | Skills | Fort | Ref | Will | Levels |
  |---+--------+----+---------------+-----+--------+------+-----+------+--------|
  |   |     76 | d6 | Witch         |   5 |     10 |    3 |   3 |    7 |     11 |
  |   |      6 |    | Mythic        |     |        |      |     |      |        |
  |---+--------+----+---------------+-----+--------+------+-----+------+--------|
  |   | Totals |    | Favored Class |     |        |      |     |      |        |
  |---+--------+----+---------------+-----+--------+------+-----+------+--------|
  | # |     82 |    | Witch         |   5 |     10 |    3 |   3 |    7 |     11 |
  |---+--------+----+---------------+-----+--------+------+-----+------+--------|
  #+TBLFM: @>$2=vsum(@2..@-2)::@>$5..@>$10=vsum(@2..@-2)

  #+NAME:Experience
  |------------+--------+--------|
  | Experience | 100932 | 105000 |
  |------------+--------+--------|

  #+NAME:Feats
  |---------------------+-------------------------------------|
  | Name                | Description                         |
  |---------------------+-------------------------------------|
  | Bonus Hex           | Fortune                             |
  | Bonus Hex           | Cauldron                            |
  | Bonus Hex           | Flight                              |
  | Improved Familiar   | Opens up access to other familiars  |
  | Craft Wondrous Item | Can craft wondrous items            |
  | Mythic Spell Lore   | Gain one mythic spell per tier      |
  | Split Hex           | When you use a hex you can cast it  |
  |                     | on another target within 30ft of it |
  |---------------------+-------------------------------------|

  #+NAME:Features
  |------------------+------------------------------------------------------|
  | Name             | Description                                          |
  |------------------+------------------------------------------------------|
  | Low Light Vision | Can see twice as far as humans in conditions of      |
  |                  | dim light                                            |
  | Elven Immunities | Elves are immune to magic sleep effects and gain a   |
  |                  | + 2 racial saving bonus enchantment spells and       |
  |                  | effects                                              |
  | Elven Magic      | Elves gain a + 2 racial bonus on caster level checks |
  |                  | to overcome spell resistance. In addition, elves     |
  |                  | recieve a + 2 bonus to on spellcraft checks to       |
  |                  | identify the properties of magic items               |
  | Keen Senses      | Elves gain a + 2 racial bonus on perception checks   |
  | Weapon Famil.    | Proficient with longswords, rapiers, shortbows       |
  |------------------+------------------------------------------------------|

  #+NAME:ClassFeatures
  |----------+-------------|
  | Name     | Description |
  |----------+-------------|
  | Cantrips |             |
  | Familiar |             |
  | Hex      |             |
  | Spells   |             |
  |----------+-------------|
  
* Defense
  #+NAME:Saves
  |---+---------------+-------+------+---------+---------+------|
  | ! | Saving Throws | Total | Base | Ability | Enhance | Misc |
  |---+---------------+-------+------+---------+---------+------|
  | # | Fortitude     |     7 |    3 |       1 |       3 |      |
  | # | Reflex        |     7 |    3 |       1 |       3 |      |
  | # | Will          |    13 |    7 |       3 |       3 |      |
  |---+---------------+-------+------+---------+---------+------|
  #+TBLFM: $5=remote(Stats,@3$Modifier)::@2$3..@4$3=vsum($4..$7)::@2$4=remote(Class, @>$Fort)::@2$5=remote(Stats, @4$Modifier)::@3$4=remote(Class, @>$Ref)::@4$4=remote(Class, @>$Will)::@4$5=remote(Stats, @6$Modifier)

  #+NAME:HP
  |---+--------------+----|
  | # | Base         | 82 |
  |   | Temporary HP |    |
  |   | Current HP   | 64 |
  |---+--------------+----|
  | # | Total        | 82 |
  |---+--------------+----|
  #+TBLFM: @1$3=remote(Class, @>$HP)::@4$3=@1$3+@2$3

  #+NAME:AC
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  | ! | Type      | Total | Base | Armor | Shield | Dex | Size | Dodge | Natural | Deflect | Misc |
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  | # | AC        |    24 |   10 |     4 | 3      |   1 |    0 |       |       3 |       3 |      |
  | # | Touch     |    14 |   10 |   N/A | N/A    |   1 |    0 |       |     N/A |       3 |      |
  | # | Flat-foot |    20 |   10 |     4 | N/A    | N/A |    0 | N/A   |       3 |       3 |      |
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  #+TBLFM: @2$3..@>$3=vsum($4..$12);N::@2$5=remote(Armor,@2$5)::@4$5=remote(Armor,@2$5)::@2$6=remote(Armor,@3$5)::@2$7..@3$7=remote(Stats,@3$Modifier)::@2$8..@4$8=remote(Size,@2$1)

  #+NAME:CMD
  |---+-----+-------+------+-----+-----+-----+------+------|
  | ! |     | Total | Base | BAB | Dex | Str | Size | Misc |
  |---+-----+-------+------+-----+-----+-----+------+------|
  | # | CMD |    15 |   10 |   5 |   1 |  -3 |    0 |    2 |
  |---+-----+-------+------+-----+-----+-----+------+------|
  #+TBLFM: @2$3=vsum($4..$9)::@2$5=remote(Class, @>$BAB)::@2$6=remote(Stats, @3$Modifier)::@2$7=remote(Stats, @2$Modifier)::@2$8=remote(Size, @2$1)

  #+NAME:Resistances
  |------------------+---|
  | Damage Reduction |   |
  | Spell Resistance |   |
  |------------------+---|

* Attacks
  #+NAME:Attacks
  |---+--------+-------+-------------------+---------+------+------|
  | ! |        | Total | Base Attack Bonus | Ability | Size | Misc |
  |---+--------+-------+-------------------+---------+------+------|
  | # | Melee  |     2 |                 5 |      -3 |    0 |      |
  | # | Ranged |     6 |                 5 |       1 |    0 |      |
  | # | CMB    |     2 |                 5 |      -3 |    0 |      |
  |---+--------+-------+-------------------+---------+------+------|
  #+TBLFM: @2$3..@4$3=vsum($4..$7)::@2$4..@4$4=remote(Class, @>$BAB)::@2$5=remote(Stats, @2$Modifier)::@2$6=remote(Size, @2$1)::@3$5=remote(Stats, @3$Modifier)::@3$6=remote(Size, @2$1)::@4$5=remote(Stats, @2$Modifier)::@4$6=remote(Size, @2$1)

  #+NAME:Weapons
  |---+-----------------+---------+------------------+--------+------+-------+------+------+-------------------|
  | ! | Weapon          | Enhance | Attack Modifiers | Damage | Crit | Range | Size | Type | Notes             |
  |---+-----------------+---------+------------------+--------+------+-------+------+------+-------------------|
  |   | Prehensile Hair |         |                  |    1d3 | x2   |       |      |      | Uses Int, not str |
  |---+-----------------+---------+------------------+--------+------+-------+------+------+-------------------|

* Skills
  # To mark as a class skill just put a 1 in the class column, org mode doesn't
  # support checkboxes in tables yet. You can add or change the ability the
  # stat depends on by modifying the Stat column. If a skill is affected by
  # armor penalty just mark it with a 1 in the Armor Penalty column
  #+NAME:Skills
  |---+-------------------+---------------+-------+----------------------+------+--------+-------+---------+---------+------|
  | ! | Training Required | Armor Penalty | Class | Skill                | Stat |  Total | Ranks | Ability | Trained | Misc |
  |---+-------------------+---------------+-------+----------------------+------+--------+-------+---------+---------+------|
  | # |                   |             1 |       | Acrobatics           | Dex  |      1 |       |       1 |         |      |
  | # |                   |               |       | Appraise             | Int  |      9 |       |       9 |         |      |
  | # |                   |               |       | Bluff                | Cha  |     -1 |       |      -1 |         |      |
  | # |                   |             1 |       | Climb                | Str  |     -3 |       |      -3 |         |      |
  | # |                   |               |     1 | Craft: Alchemy       | Int  |     29 |    11 |       9 |       3 |    6 |
  | # |                   |               |     1 | Craft:               | Int  |      9 |       |       9 |         |      |
  | # |                   |               |       | Diplomacy            | Cha  |     -1 |       |      -1 |         |      |
  | # |                 1 |             1 |       | Disable Device       | Dex  |      - |       |       1 |         |      |
  | # |                   |               |       | Disguise             | Cha  |     -1 |       |      -1 |         |      |
  | # |                   |             1 |       | Escape Artist        | Dex  |      1 |       |       1 |         |      |
  | # |                   |             1 |     1 | Fly                  | Dex  |      9 |     5 |       1 |       3 |      |
  | # |                 1 |               |       | Handle Animal        | Cha  |      - |       |      -1 |         |      |
  | # |                   |               |     1 | Heal                 | Wis  |      3 |       |       3 |         |      |
  | # |                   |               |       | Intimidate           | Cha  |     -1 |       |      -1 |         |      |
  | # |                 1 |               |     1 | Knowledge: Arcana    | Int  |     23 |    11 |       9 |       3 |      |
  | # |                 1 |               |       | Knowledge: Dungeon   | Int  |     10 |     1 |       9 |         |      |
  | # |                 1 |               |       | Knowledge: Engineer  | Int  |     10 |     1 |       9 |         |      |
  | # |                 1 |               |       | Knowledge: Geography | Int  |     12 |     3 |       9 |         |      |
  | # |                 1 |               |     1 | Knowledge: History   | Int  |     23 |    11 |       9 |       3 |      |
  | # |                 1 |               |       | Knowledge: Local     | Int  |     10 |     1 |       9 |         |      |
  | # |                 1 |               |     1 | Knowledge: Nature    | Int  |     23 |    11 |       9 |       3 |      |
  | # |                 1 |               |       | Knowledge: Nobility  | Int  |     10 |     1 |       9 |         |      |
  | # |                 1 |               |     1 | Knowledge: Planes    | Int  |     23 |    11 |       9 |       3 |      |
  | # |                 1 |               |       | Knowledge: Religion  | Int  |     10 |     1 |       9 |         |      |
  | # |                 1 |               |       | Linguistics          | Int  |     20 |    11 |       9 |         |      |
  | # |                   |               |       | Perception           | Wis  |     16 |    11 |       3 |         |    2 |
  | # |                   |               |       | Perform:             | Cha  |     -1 |       |      -1 |         |      |
  | # |                 1 |               |       | Profession:          | Wis  |      - |       |       3 |         |      |
  | # |                   |             1 |       | Ride                 | Dex  |      1 |       |       1 |         |      |
  | # |                   |               |       | Sense Motive         | Wis  |      3 |       |       3 |         |      |
  | # |                 1 |             1 |       | Sleight of Hand      | Dex  |      - |       |       1 |         |      |
  | # |                 1 |               |     1 | Spellcraft           | Int  |     23 |    11 |       9 |       3 |      |
  | # |                   |             1 |       | Stealth              | Dex  |      1 |       |       1 |         |      |
  | # |                   |               |       | Survival             | Wis  |      3 |       |       3 |         |      |
  | # |                   |             1 |       | Swim                 | Str  |     -3 |       |      -3 |         |      |
  | # |                 1 |               |     1 | Use Magic Device     | Cha  |     13 |    11 |      -1 |       3 |      |
  |---+-------------------+---------------+-------+----------------------+------+--------+-------+---------+---------+------|
  | # |                   |               |       |                      |      | Total: |   112 |         |         |      |
  |---+-------------------+---------------+-------+----------------------+------+--------+-------+---------+---------+------|
  #+TBLFM: @II$7..@III$7=if(($2 > 0 && $8 > 0) || ($2 == 0) ,vsum($8..$11)+($3*remote(Armor, @>$Penalty)), string("-"))::@II$9..@III$9='(cond ((string= $6 "Str") remote(Stats, @2$Modifier)) ((string= $6 "Dex") remote(Stats, @3$Modifier)) ((string= $6 "Int") remote(Stats, @5$Modifier)) ((string= $6 "Wis") remote(Stats, @6$Modifier)) ((string= $6 "Cha") remote(Stats, @7$Modifier)))::@II$10..@III$10=if($4 > 0 && $8 > 0, 3, string(""))::@>$8=vsum(@2$8..@-1$8)
  
* Inventory

** Equipment
   # Just add new rows for new items
   #+NAME:Equipment
   |---+-----------------------+----------+------------------+---------------|
   | ! | Name                  | Quantity | Effective Weight | Actual Weight |
   |---+-----------------------+----------+------------------+---------------|
   |   | Silk scarf            |        1 |                  |               |
   |   | Handy Haversack       |        1 |                5 |             5 |
   |   | Ring of Sustenance    |        1 |                  |               |
   |   | Cauldron              |        1 |                  |             5 |
   |   | Traveler's Anytool    |        1 |                  |             2 |
   |   | Ring of Prot (3)      |        1 |                  |               |
   |   | Ring of Nat (3)       |        1 |                  |               |
   |   | Mithral Buckler (2)   |        1 |                3 |             3 |
   |   | Silver Mirror         |        1 |                  |             1 |
   |   | Spell component pouch |        1 |                2 |             2 |
   |   | Foaming Powder        |        1 |                1 |             0 |
   |   | Cloak of Res (3)      |        1 |                1 |             1 |
   |   | Alchemist's Lab       |        1 |                0 |            40 |
   |   | Gem worth 100         |        1 |                0 |             0 |
   |   | Research materials    |        1 |                0 |            10 |
   |   | Crafting mats         |     1525 |                  |               |
   |   | Bound Book            |        1 |                  |               |
   |   | Cube with needles     |        1 |                  |               |
   |   | Gallacles tools       |        ? |                  |               |
   |   | cloak of Res (1)      |          |                  |               |
   |---+-----------------------+----------+------------------+---------------|
   | # | Total Weight:         |          |               12 |            69 |
   |---+-----------------------+----------+------------------+---------------|
   #+TBLFM: @>$4=vsum(@2$4..@-2$4)::@>$5=vsum(@2$5..@-2$5)

   # Worn magic items
   #+NAME:WornEquipment
   |-----------+---------------------------|
   | Head      |                           |
   | Face      |                           |
   | Throat    | Amulet Nat (3)            |
   | Shoulders | Cloak of Resis (3)        |
   | Body      |                           |
   | Torso     | Cackling Hags Blouse      |
   | Arms      |                           |
   | Hands     | Gloves of Arrow Snatching |
   | Ring      | Ring of Sustenence        |
   | Ring      | Ring of Prot (3)          |
   | Waist     | Belt of Dex (2)           |
   | Feet      |                           |
   |-----------+---------------------------|

   #+NAME:Armor
   |---+---------+--------------+---------+----+---------+---------+----------------+------+------+----------|
   | ! | Type    | Name         | Enhance | AC | Max Dex | Penalty | Spell Fail (%) | Type | Size | Material |
   |---+---------+--------------+---------+----+---------+---------+----------------+------+------+----------|
   |   | Armor   | Mage Armor   |         |  4 |         |         |                |      |      |          |
   |   | Shield  | Buckler      |       2 |  3 |         |       0 |              0 |      |      | Mithral  |
   |   | Ring    | Ring of Prot |         |  2 |         |         |                |      |      |          |
   |   | Ring    |              |         |    |         |         |                |      |      |          |
   |   | Amulet  | Amulet Nat   |       2 |  2 |         |         |                |      |      |          |
   |---+---------+--------------+---------+----+---------+---------+----------------+------+------+----------|
   | # | Totals: |              |         | 21 |       0 |       0 |              0 |      |      |          |
   |---+---------+--------------+---------+----+---------+---------+----------------+------+------+----------|
   #+TBLFM: @>$5=10+vsum(@<<$5..@-1$5)::@>$6=@3$6::@>$7=vsum(@3$7..@-1$7)::@>$8=vsum(@3$8..@-1$8)

** Magic Items
   #+NAME:MagicItems
   |-------------------+---------+--------------|
   | Item              | Charges | Caster Level |
   |-------------------+---------+--------------|
   | Pearl of Power 2  |       1 |           17 |
   | Bead of Newt Prev |       1 |              |
   | Less. Empow. Rod  |         |              |
   | Cure light wounds |      99 |            1 |
   |-------------------+---------+--------------|
   
** Wealth
   #+NAME:Wealth
   |----------+--------|
   | Platinum |      7 |
   | Gold     |    606 |
   | Silver   |      2 |
   | Copper   |      5 |
   |----------+--------|

** Bags and Containers
   #+NAME:Bags
   |-----------------+--------+--------|
   | Container       | Volume | Weight |
   |-----------------+--------+--------|
   | Handy Haversack | 12     | 120    |
   |-----------------+--------+--------|

* Spells
  #+NAME:CastingStat
  |---+--------------+-----+---|
  | # | Casting Stat | Int | 9 |
  |---+--------------+-----+---|
  #+TBLFM:@1$4='(cond ((string= $3 "Int") remote(Stats, @5$Modifier)) ((string= $3 "Wis") remote(Stats, @6$Modifier)) ((string= $3 "Cha") remote(Stats, @7$Modifier)))

  #+NAME:SpellInfo
  |---+---------+-------------+-------+-------------+---------+------+-------------|
  | ! | Save DC | Spell Level | Total | Class Bonus | Ability | Misc | Total Known |
  |---+---------+-------------+-------+-------------+---------+------+-------------|
  | # |      19 |           0 |     4 |           4 |         |      |             |
  | # |      20 |           1 |     7 |           4 |       3 |      |             |
  | # |      21 |           2 |     6 |           4 |       2 |      |             |
  | # |      22 |           3 |     5 |           3 |       2 |      |             |
  | # |      23 |           4 |     5 |           3 |       2 |      |             |
  | # |      24 |           5 |     4 |           2 |       2 |      |             |
  | # |      25 |           6 |     2 |           1 |       1 |      |             |
  | # |      26 |           7 |     1 |             |       1 |      |             |
  | # |      27 |           8 |     1 |             |       1 |      |             |
  | # |      28 |           9 |     1 |             |       1 |      |             |
  |---+---------+-------------+-------+-------------+---------+------+-------------|
  #+TBLFM: $4=vsum($5..$8)::$2=if($4 > 0, 10+$3+remote(CastingStat, @1$4), string(""))::@3$6..@>$6=max(0, (remote(CastingStat, @1$4)-$3)\4+1)
  # 

  #+NAME:CasterLevel
  |--------------+----|
  | Caster Level | 11 |
  |--------------+----|

  #+NAME:Concentration
  |---+---------------+-------+------+---------+------|
  | ! |               | Total | Base | Ability | Misc |
  |---+---------------+-------+------+---------+------|
  | # | Concentration |    20 |   11 |       9 |      |
  |---+---------------+-------+------+---------+------|
  #+TBLFM: @2$3=vsum($4..$6)::@2$4=remote(CasterLevel, @1$2)::@2$5=remote(CastingStat, @1$4)

  #+NAME:SpellRanges
  |---+--------+------|
  | # | Close  | 52.5 |
  | # | Medium |  210 |
  | # | Long   |  840 |
  |---+--------+------|
  #+TBLFM: @1$3=25+remote(CasterLevel,@1$2)*5/2::@2$3=100+remote(CasterLevel, @1$2)*10::@3$3=400+remote(CasterLevel, @1$2)*40

  # See DahliaSpellBook.org
  #+NAME:Spells
  |------------+-------+-----------------------+-------------+---------|
  | # Prepared | Level | Name                  | Description | Save DC |
  |------------+-------+-----------------------+-------------+---------|
  |            |     0 | Detect Magic          |             |      19 |
  |            |     0 | Dancing Lights        |             |      19 |
  |            |     0 | Message               |             |      19 |
  |            |     0 | Spark                 |             |      19 |
  | 1/1        |     1 | Reduce Person         |             |      20 |
  | 1/1        |     1 | Ear Piercing Scream   |             |      20 |
  | 2/2        |     1 | Mage Armor            |             |      20 |
  | 1/1        |     1 | Fog Cloud             |             |      20 |
  | 2/2        |     1 | Silent Image          |             |      20 |
  | 0/1        |     1 | Burning Hands         |             |      20 |
  | 0/2        |     2 | Communal Mount        |             |      21 |
  | 1/1        |     2 | Communal Mask Dweomer |             |      21 |
  | 1/1        |     2 | Detect Thoughts       |             |      21 |
  | 0/1        |     2 | Web Shelter           |             |      21 |
  | 1/1        |     2 | Hold Person           |             |      21 |
  | 2/2        |     2 | Cure Moderate Wounds  |             |      21 |
  | 1/1        |     2 | See invisibility      |             |      21 |
  | 0/1        |     3 | Remove Curse          |             |      22 |
  | 1          |     3 | Stinking Cloud        |             |      22 |
  | 1          |     3 | Suggestion            |             |      22 |
  | 2/2        |     3 | Dispel Magic          |             |      22 |
  | 1/1        |     3 | Deeper Darkness       |             |      22 |
  | 1          |     4 | Threefold Aspect      |             |      23 |
  | 1/1        |     4 | Dimension Door        |             |      23 |
  | 1/1        |     4 | Black Tentacles       |             |      23 |
  | 2/2        |     4 | Shadow Conjuration    |             |      23 |
  | 1/1        |     5 | Baleful Polymorph     |             |      24 |
  | 0/1        |     5 | Magic Jar             |             |      24 |
  | 2/2        |     5 | Shadow Evocation      |             |      24 |
  | 1/1        |     6 | Dust Form             |             |      25 |
  | 1/1        |     6 | Greater Dispel Magic  |             |      25 |
  |------------+-------+-----------------------+-------------+---------|

** Special Abilities
   #+NAME:SpecialAbilities
   |----------------------+-----------------------------------------------------------|
   | Name                 | Uses/Day                                                  |
   |----------------------+-----------------------------------------------------------|
   | [[http://www.d20pfsrd.com/classes/base-classes/witch/hexes---3rd-party-publishers/hexes/common-hexes/hex-cackle-su][Cackle(Su)]]           | As a move action increase the duration of various hexes   |
   |                      | on enemies within 30ft                                    |
   | [[http://www.d20pfsrd.com/classes/base-classes/witch/hexes---3rd-party-publishers/hexes/common-hexes/hex-evil-eye-su][Evil Eye(Su)]]         | Reduce by -4 either: AC, ability checks, attack rolls,    |
   |                      | saving rolls, or skill checks. Lasts for (3+int) rounds,  |
   |                      | will save reduces to 1 round                              |
   | [[http://www.d20pfsrd.com/classes/base-classes/witch/hexes---3rd-party-publishers/hexes/common-hexes/hex-misfortune-su][Misfortune(Su)]]       | Gives disadvantage on d20 rolls for 2 rounds. Will save   |
   |                      | negates, creature can only be a target once per day       |
   | [[http://www.d20pfsrd.com/classes/base-classes/witch/hexes---3rd-party-publishers/hexes/common-hexes/hex-charm-su][Charm(Su)]]            | Improve attitude of creature in 30ft by two steps. A      |
   |                      | creature can only be a target once per day.               |
   | [[http://www.d20pfsrd.com/classes/base-classes/witch/hexes---3rd-party-publishers/hexes/common-hexes/hex-prehensile-hair-su][Prehensile Hair(Su)]]  | Instantly grow hair up to 10ft long. It acts as a limb    |
   |                      | with str equal to int. Has 10ft reach and can deal 1d3.   |
   |                      | Can be used for a number minutes equal to level each day  |
   | [[http://www.d20pfsrd.com/classes/base-classes/witch/hexes---3rd-party-publishers/hexes/common-hexes/hex-flight-su][Flight(Su)]]           | Can featherfall at will, levitate once per day, and       |
   |                      | fly equal to a minute per level.                          |
   | Fortune (Su)         | Give creature ability to reroll a d20 once per round      |
   |                      | Lasts two rounds, once a day, can be extended with cackle |
   | Ice Tomb (Su)        | Encompass a target in a block of ice 3d8 cold, fort       |
   |                      | negates, range 60ft. Melts in temperate at 1 min/lvl      |
   | Wild Arcana(Ex)      | Can cast any spell on the spell list as a swift action at |
   |                      | +2 caster level                                           |
   | Coupled Arcana(Ex)   | When activating an ability you can activate one that uses |
   |                      | mythic power as a free action                             |
   | Hard to Kill(Ex)     | Twice negative con to die, automatically stabilize        |
   | Surge(Ex)            | Add 1d6 with a use of mythic power                        |
   | Eldritch Breach (Ex) | Advantage on spell resistance, dispel rolls, or to affect |
   |                      | creature                                                          |
   |----------------------+-----------------------------------------------------------|


* Familiar
** Familiar Info
   - Name :: Yarrow
   - Race :: Liminal Sprite
   - Gender :: Female
   - Height ::
   - Weight ::
   - Age ::
   - Alignment :: Chaotic Neutral
   - Languages :: Elven, Common, Sylvan

   #+NAME:FSize 
   |------------|
   | Size Bonus |
   |------------|
   |          2 |
   |------------|
		  
** Familiar Stats
   #+NAME:FStats
   |---+--------------+-------+----------+------+----------+---------+------|
   | ! | Stat         | Total | Modifier | Base | Inherent | Enhance | Misc |
   |---+--------------+-------+----------+------+----------+---------+------|
   | # | Strength     |     8 | -1       |    8 |          |         |      |
   | # | Dexterity    |    17 | 3        |   17 |          |         |      |
   | # | Constitution |    14 | 2        |   14 |          |         |      |
   | # | Intelligence |    15 | 2        |   15 |          |         |      |
   | # | Wisdom       |    12 | 1        |   12 |          |         |      |
   | # | Charisma     |    15 | 2        |   15 |          |         |      |
   |---+--------------+-------+----------+------+----------+---------+------|
   #+TBLFM: $3=vsum($5..$8)::$4=floor(($3 - 10) / 2)

   #+NAME:Initiative
   |---+------------+-------+------+------|
   | ! |            | Total | Base | Misc |
   |---+------------+-------+------+------|
   | # | Initiative |     7 |    3 |    4 |
   |---+------------+-------+------+------|
   #+TBLFM: @2$3=vsum(@2$4..@2$5)::@2$4=remote(FStats, @3$Modifier)

** Familiar Class
   #+NAME:FClass
   |---+----+----+----------------+-----+--------+------+-----+------+--------|
   | ! | HP | HD | Class Name     | BAB | Skills | Fort | Ref | Will | Levels |
   |---+----+----+----------------+-----+--------+------+-----+------+--------|
   | # | 38 | d6 | Luminal Sprite |   5 | -      |    3 |   3 |    7 |        |
   |---+----+----+----------------+-----+--------+------+-----+------+--------|
   #+TBLFM: @2$2=remote(Class,@2$2)\2::@2$3=remote(Class,@2$3)::@2$5=remote(Class,@2$5)::@2$7=remote(Class,@2$7)::@2$8=remote(Class,@2$8)::@2$9=remote(Class,@2$9)

   #+Name:FFeats
   |---------------------+--------------------------------------------|
   | Name                | Description                                |
   |---------------------+--------------------------------------------|
   | Improved Initiative | +4 to initiative                           |
   | Weapon Finesse      | May use dex instead of str on some weapons |
   |---------------------+--------------------------------------------|

   #+Name:FClassFeatures
   |-----------------+---------------------------------------------------------------|
   | Name            | Description                                                   |
   |-----------------+---------------------------------------------------------------|
   | Raepartee       | Thrice a day, when aiding another creature's charisma based   |
   |                 | skill check, the creature gets +2d4 instead of +2             |
   | Versatile Perf  | A liminal sprite can use perform comedy bonus instead when    |
   |                 | bluffing or intimidating                                      |
   | Alertness       | While a familiar is within arm's reach, the master gains the  |
   |                 | [[http://www.d20pfsrd.com/feats/general-feats/alertness---final][Alertness feat.]]                                               |
   | Empathic Link   | The master has an empathic link with her familiar to a 1 mile |
   |                 | distance. Only general emotions can be shared.                |
   | Improved Ev.    | Take half damage on failed reflex save, none on successful    |
   | Share spells    | Personal spells may be cast on familiar                       |
   | Deliver Touch   | If in contact the witch can designate the familiar to deliver |
   |                 | the touch attack                                              |
   | Speak w/ master | The familiar and master can communicate verbally as if they   |
   |                 | were using a common language.                                 |
   |-----------------+---------------------------------------------------------------|

** Familiar Defense

   #+NAME:FSaves
   |---+---------------+-------+------+---------+---------+------|
   | ! | Saving Throws | Total | Base | Ability | Enhance | Misc |
   |---+---------------+-------+------+---------+---------+------|
   | # | Fortitude     |     4 |    3 |       1 |         |      |
   | # | Reflex        |     6 |    3 |       3 |         |      |
   | # | Will          |     8 |    7 |       1 |         |      |
   |---+---------------+-------+------+---------+---------+------|
   #+TBLFM: $5=remote(FStats,@3$Modifier)::@2$3..@4$3=vsum($4..$7)::@2$4=remote(Class, @>$Fort)::@2$5=remote(Stats, @4$Modifier)::@3$4=remote(Class, @>$Ref)::@4$4=remote(FClass, @>$Will)::@4$5=remote(FStats, @6$Modifier)

   #+NAME:FHP
   |---+--------------+----|
   | # | Base         | 38 |
   |   | Temporary HP | 51 |
   |   | Current HP   | 51 |
   |---+--------------+----|
   | # | Total        | 38 |
   |---+--------------+----|
   #+TBLFM: @1$3=remote(FClass, @2$HP)::@4$3=@1$3+@2$3

   #+NAME:FAC
   |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
   | ! | Type      | Total | Base | Armor | Shield | Dex | Size | Dodge | Natural | Deflect | Misc |
   |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
   | # | AC        |    22 |   10 |     0 | 0      |   3 |    2 |       |       7 |         |      |
   | # | Touch     |    15 |   10 |   N/A | N/A    |   3 |    2 |       |     N/A |         |      |
   | # | Flat-foot |    18 |   10 |     0 | N/A    | N/A |    2 | N/A   |       6 |         |      |
   |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
   #+TBLFM: @2$3..@>$3=vsum($4..$12);N::@2$5=remote(FArmor, @2$AC)::@2$6=0::@2$7..@3$7=min(remote(FStats, @3$Modifier), remote(FArmor, @>$6)::@2$8..@>$8=remote(FSize, @2$1)::@4$5=remote(FArmor, @2$AC)

   #+NAME:FCMD
   |---+-----+-------+------+-----+-----+-----+------+------|
   | ! |     | Total | Base | BAB | Dex | Str | Size | Misc |
   |---+-----+-------+------+-----+-----+-----+------+------|
   | # | CMD |    19 |   10 |   5 |   3 |  -1 |    2 |      |
   |---+-----+-------+------+-----+-----+-----+------+------|
   #+TBLFM: @2$3=vsum($4..$9)::@2$5=remote(FClass, @>$BAB)::@2$6=remote(FStats, @3$Modifier)::@2$7=remote(FStats, @2$Modifier)::@2$8=remote(FSize, @2$1)

   #+NAME:FResistances
   |------------------+-------------|
   | Damage Reduction | 5/Cold Iron |
   | Spell Resistance |          13 |
   |------------------+-------------|

   #+NAME:FArmor
   |---+---------+------+---------+----+---------+---------+----------------+------+------+----------|
   | ! | Type    | Name | Enhance | AC | Max Dex | Penalty | Spell Fail (%) | Type | Size | Material |
   |---+---------+------+---------+----+---------+---------+----------------+------+------+----------|
   |   |         |      |         |    |      10 |         |                |      |      |          |
   |---+---------+------+---------+----+---------+---------+----------------+------+------+----------|
   | # | Totals: |      |         | 10 |      10 |       0 |              0 |      |      |          |
   |---+---------+------+---------+----+---------+---------+----------------+------+------+----------|
   #+TBLFM: @>$5=10+vsum(@2$5..@-1$5)::@>$6=@2$6::@>$7=vsum(@2$7..@-1$7)::@>$8=vsum(@2$8..@-1$8)

** Familiar Attacks
   #+NAME:FAttacks
   |---+--------+-------+-------------------+---------+------+------|
   | ! |        | Total | Base Attack Bonus | Ability | Size | Misc |
   |---+--------+-------+-------------------+---------+------+------|
   | # | Melee  |    10 |                 5 |       3 |    2 |      |
   | # | Ranged |    10 |                 5 |       3 |    2 |      |
   | # | CMB    |    10 |                 5 |       3 |    2 |      |
   |---+--------+-------+-------------------+---------+------+------|
   #+TBLFM: @2$3..@4$3=vsum($4..$7)::@2$4..@4$4=remote(FClass, @>$BAB)::@2$5=remote(FStats, @3$Modifier)::@2$6=remote(FSize, @2$1)::@3$5=remote(FStats, @3$Modifier)::@3$6=remote(FSize, @2$1)::@4$5=remote(FStats, @3$Modifier)::@4$6=remote(FSize, @2$1)

   #+NAME:FWeapons
   |---+--------+---------+------------------+--------+------+-------+------+------+--------------------|
   | ! | Weapon | Enhance | Attack Modifiers | Damage | Crit | Range | Size | Type | Notes              |
   |---+--------+---------+------------------+--------+------+-------+------+------+--------------------|
   |   | Rapier |         | 9                |    1d3 | x2   | 18-20 |      | P    | Uses Dex from feat |
   |---+--------+---------+------------------+--------+------+-------+------+------+--------------------|

** Familiar Skills
   #+NAME:Skills
   |---+----+----+---+------------------+------+--------+-------+---------+---+---|
   | ! | TR | AP | C | Skill            | Stat |  Total | Ranks | Ability | T | M |
   |---+----+----+---+------------------+------+--------+-------+---------+---+---|
   | # |    |    |   | Diplomacy        | Cha  |      8 |     6 |       2 |   |   |
   | # |    |    |   | Escape Artist    | Dex  |      9 |     6 |       3 |   |   |
   | # |    |    |   | Fly              | Dex  |     17 |    14 |       3 |   |   |
   | # |  1 |    |   | Knowledge: Local | Int  |      8 |     6 |       2 |   |   |
   | # |    |    |   | Perception       | Wis  |      7 |     6 |       1 |   |   |
   | # |    |    |   | Perform: Comedy  | Cha  |      8 |     6 |       2 |   |   |
   | # |    |    |   | Sense Motive     | Wis  |      7 |     6 |       1 |   |   |
   | # |    |    |   | Stealth          | Dex  |     17 |    14 |       3 |   |   |
   |---+----+----+---+------------------+------+--------+-------+---------+---+---|
   | # |    |    |   |                  |      | Total: |    64 |         |   |   |
   |---+----+----+---+------------------+------+--------+-------+---------+---+---|
   #+TBLFM: @II$7..@III$7=if(($2 > 0 && $8 > 0) || ($2 == 0) ,vsum($8..$11)+($3*remote(FArmor, @>$Penalty)), string("-"))::@II$9..@III$9='(cond ((string= $6 "Str") remote(FStats, @2$Modifier)) ((string= $6 "Dex") remote(FStats, @3$Modifier)) ((string= $6 "Int") remote(FStats, @5$Modifier)) ((string= $6 "Wis") remote(FStats, @6$Modifier)) ((string= $6 "Cha") remote(FStats, @7$Modifier)))::@II$10..@III$10=if($4 > 0 && $8 > 0, 3, string(""))::@>$8=vsum(@2$8..@-1$8)

** Familiar Spells
   #+Name:FCastingStat
   |---+--------------+-----+---|
   | # | Casting Stat | Cha | 2 |
   |---+--------------+-----+---|
   #+TBLFM:@1$4='(cond ((string= $3 "Int") remote(FStats, @5$Modifier)) ((string= $3 "Wis") remote(FStats, @6$Modifier)) ((string= $3 "Cha") remote(FStats, @7$Modifier)))

   #+NAME:FSpellInfo
   |---+---------+-------------+-------+-------------+---------+------+-------------|
   | ! | Save DC | Spell Level | Total | Class Bonus | Ability | Misc | Total Known |
   |---+---------+-------------+-------+-------------+---------+------+-------------|
   | # |      12 |           0 |     4 |           4 |         |      |             |
   | # |      13 |           1 |     5 |           4 |       1 |      |             |
   | # |      14 |           2 |     4 |           3 |       1 |      |             |
   | # |      15 |           3 |     3 |           3 |       0 |      |             |
   | # |      16 |           4 |     2 |           2 |       0 |      |             |
   | # |         |           5 |     0 |             |       0 |      |             |
   | # |         |           6 |     0 |             |       0 |      |             |
   | # |         |           7 |     0 |             |       0 |      |             |
   | # |         |           8 |     0 |             |       0 |      |             |
   | # |         |           9 |     0 |             |       0 |      |             |
   |---+---------+-------------+-------+-------------+---------+------+-------------|
   #+TBLFM: $4=vsum($5..$8)::$2=if($4 > 0, 10+$3+remote(FCastingStat, @1$4), string(""))::@3$6..@>$6=max(0, (remote(FCastingStat, @1$4)-$3)\4+1)
  
   #+NAME:FCasterLevel
   |--------------+----|
   | Caster Level | 11 |
   |--------------+----|
   #+TBLFM: @1$2=remote(CasterLevel, @1$2)

   #+NAME:FConcentration
   |---+---------------+-------+------+---------+------|
   | ! |               | Total | Base | Ability | Misc |
   |---+---------------+-------+------+---------+------|
   | # | Concentration |    13 |   11 |       2 |      |
   |---+---------------+-------+------+---------+------|
   #+TBLFM: @2$3=vsum($4..$6)::@2$4=remote(FCasterLevel, @1$2)::@2$5=remote(FCastingStat, @1$4)

   #+NAME:FSpellRanges
   |---+--------+------|
   | # | Close  | 52.5 |
   | # | Medium |  210 |
   | # | Long   |  840 |
   |---+--------+------|
   #+TBLFM: @1$3=25+remote(FCasterLevel,@1$2)*5/2::@2$3=100+remote(FCasterLevel, @1$2)*10::@3$3=400+remote(FCasterLevel, @1$2)*40

   #+Name:FSpells
   |-------+---------------------+-------------+---------|
   | Level | Name                | Description | Save DC |
   |-------+---------------------+-------------+---------|
   |     0 | Daze                |             |      12 |
   |     0 | Prestidigitation    |             |         |
   |     1 | Fumbletongue        |             |      13 |
   |     1 | Invisibility (self) |             |         |
   |     1 | Memory Lapse        |             |      13 |
   |-------+---------------------+-------------+---------|
